analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32570/Include/max32570.svd
   </registers>
  </peripheral>
<!--DMA DMA Controller Fully programmable, chaining capable DMA channels.-->
  <peripheral>
   <name>EMAC</name>
   <description>10/100 Ethernet MAC.</description>
   <baseAddress>0x4004F000</baseAddress>
   <addressBlock>
    <offset>0</offset>
    <size>0x1000</size>
    <usage>registers</usage>
   </addressBlock>
   <interrupt>
    <name>EMAC</name>
    <description>EMAC IRQ</description>
    <value>64</value>
   </interrupt>
   <registers>
    <register>
     <name>CN</name>
     <description>Network Control Register.</description>
     <addressOffset>0x00</addressOffset>
     <resetValue>0x00</resetValue>
     <fields>
      <field>
       <name>LB</name>
       <description>Loopback.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>LBL</name>
       <description>Loopback local.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>RXEN</name>
       <description>Receive Enable.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>TXEN</name>
       <description>Transmit Enable.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>MPEN</name>
       <description>Management Port Enable.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>CLST</name>
       <description>Clear Statistics.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>INCST</name>
       <description>Increment Statistics.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>WREN</name>
       <description>Write enable for statistics registers.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>BP</name>
       <description>Back pressure.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>TXSTART</name>
       <description>Transmission start.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>TXHALT</name>
       <description>Transmit halt.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>TXPF</name>
       <description>Transmit pause frame.</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>TXZQPF</name>
       <description>Transmit zero quantum pause frame.</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>CFG</name>
     <description>Network Configuration Register.</description>
     <addressOffset>0x04</addressOffset>
     <fields>
      <field>
       <name>SPEED</name>
       <description>Speed Select.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>FULLDPLX</name>
       <description>Full Duplex. If set to 1 the transmit block ignores the state of collision and carrier sense and allows Rx while transmitting.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>BITRATE</name>
       <description>Bit Rate. Writing 1 to this bit configures the interface for serial operation. </description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>JUMBOFR</name>
       <description>Jumbo Frames. Writing 1 to this bit enables jumbo frames of up to 10,240 bytes to be accepted.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>COPYAF</name>
       <description>Copy All Frames. If 1, all valid frames will be received.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>NOBC</name>
       <description>No Broadcast. If 1, frames addressed to the broadcast address of all ones will not be received.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>MHEN</name>
       <description>Multicast Hash Enable. If 1, multicast frames will be received when the 6 bit hash function of the destination address points to a bit that is set in the hash register.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>UHEN</name>
       <description>Unicast Hash Enable. If 1, unicast frames will be received when the 6 bit hash function of the destination address points to a bit that is set in the hash register.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>RXFR</name>
       <description>Receive 1536 Byte Frames. Writing 1 to this bit means the MAC receives packets up to 1536 bytes in length. Normally the MAC rejects any packet above 1518 bytes</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>MDCCLK</name>
       <description>MDC Frequency. Set according to PCLK speed. This field determines by what number PCLK is divided to generate MDC.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>2</bitWidth>
       <access>write-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>div8</name>
         <description>PCLK up to 20MHz</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>div16</name>
         <description>PCLK up to 40MHz</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>div32</name>
         <description>PCLK up to 80MHz</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>div64</name>
         <description>PCLK up to 160MHz</description>
         <value>3</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RTTST</name>
       <description>Retry Test. Must be set to zero for normal operation. If set to 1, the back-off between collisions is always one slot time.</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PAUSEEN</name>
       <description>Pause Enable. If 1, Ethernet packet transmission pauses when a valid pause packet is received.</description>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>RXBUFFOFS</name>
       <description>Receive buffer offset. These bits indicate the number of bytes by which the received data is offset from the start of the first receive buffer.</description>
       <bitOffset>14</bitOffset>
       <bitWidth>2</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>RXLFCEN</name>
       <description>Receive length field checking enable. If 1, packets with measured lengths shorter than their length fields are discarded. Packets containing a type ID in bytes 13 and 14 (length/type field &gt;=0600) are not counted as length errors.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>DCRXFCS</name>
       <description>Discard receive FCS. If 1, the FCS field of received frames will not be copied to memory.</description>
       <bitOffset>17</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>HDPLXRXEN</name>
       <description>Enable packets to be received in half-duplex mode while transmitting.</description>
       <bitOffset>18</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>IGNRXFCS</name>
       <description>Ignore RX FCS. If 1, packets with FCS/CRC errors are not rejected and no FCS error statistics are counted. For normal operation, this bit must be set to 0.</description>
       <bitOffset>19</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>STATUS</name>
     <description>Network Status Register.</description>
     <addressOffset>0x08</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>LINK</name>
       <description>LINK pin status. Returns status of EMAC_LINK pin.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>MDIO</name>
       <description>MDIO pin status. Returns status of the EMAC_MDIO pin. Use the PHY maintenance register for reading managed frames rather than this bit.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>IDLE</name>
       <description>PHY management logic status.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>TX_ST</name>
     <description>Transmit Status Register.</description>
     <addressOffset>0x14</addressOffset>
     <fields>
      <field>
       <name>UBR</name>
       <description>Used Bit Read. Set when a transmit buffer descriptor is read with its used bit set. Write 1 to clear this bit.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>COLS</name>
       <description>Collision Occurred. Set when a collision occurs. Write 1 to clear this bit.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>RTYLIM</name>
       <description>Retry Limit Exceeded. Set when the retry limit has been exceeded. Write 1 to clear this bit. </description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>TXGO</name>
       <description>Transmit Go. If 1, transmit is active.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>BEMF</name>
       <description>Buffers Exhausted Mid Frame. If the buffers run out during transmission of a frame then transmission stops, FCS shall be bad and EMAC_TXER asserted. Write 1 to clear this bit.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>TXCMPL</name>
       <description>Transmit Complete. Set when a frame has been transmitted. Write 1 to clear this bit.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>TXUR</name>
       <description>Transmit Underrun. Set when the MAC transmit FIFO was read while was empty. If this happens the transmitter forces bad. Write 1 to clear this bit.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>RXBUF_PTR</name>
     <description>Receive Buffer Queue Pointer Register.</description>
     <addressOffset>0x18</addressOffset>
     <fields>
      <field>
       <name>RXBUF</name>
       <description>Receive buffer queue pointer. Written with the address of the start of the receive queue, reads as a pointer to the current buffer being used.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>30</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>TXBUF_PTR</name>
     <description>Transmit Buffer Queue Pointer Register.</description>
     <addressOffset>0x1C</addressOffset>
     <fields>
      <field>
       <name>TXBUF</name>
       <description>Transmit buffer queue pointer. Written with the address of the start of the transmit queue, reads as a pointer to the first buffer of the frame being transmitted or about to be transmitted.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>30</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>RX_ST</name>
     <description>Receive Status Register.</description>
     <addressOffset>0x20</addressOffset>
     <fields>
      <field>
       <name>BNA</name>
       <description>Buffer Not Available. An attempt was made to get a new buffer and the pointer indicated that it was owned by the processor. The DMA will reread the pointer each time a new frame starts until a valid pointer is found. This bit will be set at each attempt that fails even if it has not had a successful pointer read since it has been cleared. Write 1 to clear this bit.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>FR</name>
       <description>Frame Received. One or more frames have been received and placed in memory. Write 1 to clear this bit.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>RXOR</name>
       <description>Receive Overrun. The DMA block was unable to store the receive frame to memory. Either because the AHB bus was not granted in time or because a not OK hresp was returned. The buffer will be recovered if this happens. Write 1 to clear this bit.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>INT_ST</name>
     <description>Interrupt Status Register.</description>
     <addressOffset>0x24</addressOffset>
     <fields>
      <field>
       <name>MPS</name>
       <description>Management Packet Sent Interrupt Status. The PHY maintenance register has completed its operation. Cleared when read.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>RXCMPL</name>
       <description>Receive Complete Interrupt Status. Set when a frame has been stored in memory. Cleared when read.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>RXUBR</name>
       <description>RX Used Bit Read Interrupt Status. Set when a receive buffer descriptor is read with its used bit set. Cleared when read.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>TXUBR</name>
       <description>TX Used Bit Read Interrupt Status. Set when a transmit buffer descriptor is read with its used bit set. Cleared when read</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>TXUR</name>
       <description>Ethernet Transmit Underrun Interrupt Status. Set when the MAC transmit FIFO was read while was empty. If this happens the transmitter forces bad CRC and forces EMAC_TXER high. Cleared when read.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>RLE</name>
       <description>Retry Limit Exceeded Interrupt Status. Transmit error. Cleared when read.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>TXERR</name>
       <description>Transmit Buffers Exhausted In Mid-frame Interrupt Status. Transmit error. Cleared when read.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>TXCMPL</name>
       <description>Transmit Complete Interrupt Status. Set when a frame has been transmitted. Cleared when read.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>LC</name>
       <description>Link Change Interrupt Status. Set when the external link signal changes. Cleared when read.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>RXOR</name>
       <description>Receive Overrun Interrupt Status. Set when the receive overrun status bit gets set. Cleared when read.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>HRESPNO</name>
       <description>hresp not OK Interrupt Status. Set when the DMA block sees hresp not OK. Cleared when read.</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>PPR</name>
       <description>Pause Packet Received Interrupt Status. Indicates a valid pause packet has been received. Cleared when read.</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>PTZ</name>
       <description>Pause Time Zero Interrupt Status. Set when the MAC Pause Time register (MAC_PT) decrements to zero. Cleared when read.</description>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>INT_EN</name>
     <description>Interrupt Enable Register.</description>
     <addressOffset>0x28</addressOffset>
     <access>write-only</access>
     <fields>
      <field>
       <name>MPS</name>
       <description>Management Packet Sent Interrupt Enable</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>RXCMPL</name>
       <description>Receive Complete Interrupt Enable</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>RXUBR</name>
       <description>RX Used Bit Read Interrupt Enable</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>TXUBR</name>
       <description>TX Used Bit Read Interrupt Enable</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>TXUR</name>
       <description>Ethernet Transmit Underrun Interrupt Enable</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>RLE</name>
       <description>Retry Limit Exceeded Interrupt Enable</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>TXERR</name>
       <description>Transmit Buffers Exhausted In Mid-frame Interrupt Enable</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>TXCMPL</name>
       <description>Transmit Complete Interrupt Enable</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>LC</name>
       <description>Link Change Interrupt Enable</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>RXOR</name>
       <description>Receive Overrun Interrupt Enable</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>HRESPNO</name>
       <description>hresp not OK Interrupt Enable</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PPR</name>
       <description>Pause Packet Received Interrupt Enable</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PTZ</name>
       <description>Pause Time Zero Interrupt Enable</description>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
     </fields>
    </register>
