analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32570/Include/max32570.svd
    <register>
     <name>INT_DIS</name>
     <description>Interrupt Disable Register.</description>
     <addressOffset>0x2C</addressOffset>
     <access>write-only</access>
     <fields>
      <field>
       <name>MPS</name>
       <description>Management Packet Sent Interrupt Disable</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>RXCMPL</name>
       <description>Receive Complete Interrupt Disable</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>RXUBR</name>
       <description>RX Used Bit Read Interrupt Disable</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>TXUBR</name>
       <description>TX Used Bit Read Interrupt Disable</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>TXUR</name>
       <description>Ethernet Transmit Underrun Interrupt Disable</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>RLE</name>
       <description>Retry Limit Exceeded Interrupt Disable</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>TXERR</name>
       <description>Transmit Buffers Exhausted In Mid-frame Interrupt Disable</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>TXCMPL</name>
       <description>Transmit Complete Interrupt Disable</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>LC</name>
       <description>Link Change Interrupt Disable</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>RXOR</name>
       <description>Receive Overrun Interrupt Disable</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>HRESPNO</name>
       <description>hresp not OK Interrupt Disable</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PPR</name>
       <description>Pause Packet Received Interrupt Disable</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
      <field>
       <name>PTZ</name>
       <description>Pause Time Zero Interrupt Disable</description>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>INT_MASK</name>
     <description>Interrupt Mask Register.</description>
     <addressOffset>0x30</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>MPS</name>
       <description>Management Packet Sent Interrupt Mask</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>RXCMPL</name>
       <description>Receive Complete Interrupt Mask</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>RXUBR</name>
       <description>RX Used Bit Read Interrupt Mask</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>TXUBR</name>
       <description>TX Used Bit Read Interrupt Mask</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>TXUR</name>
       <description>Ethernet Transmit Underrun Interrupt Mask</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>RLE</name>
       <description>Retry Limit Exceeded Interrupt Mask</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>TXERR</name>
       <description>Transmit Buffers Exhausted In Mid-frame Interrupt Mask</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>TXCMPL</name>
       <description>Transmit Complete Interrupt Mask</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>LC</name>
       <description>Link Change Interrupt Mask</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>RXOR</name>
       <description>Receive Overrun Interrupt Mask</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>HRESPNO</name>
       <description>hresp not OK Interrupt Mask</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>PPR</name>
       <description>Pause Packet Received Interrupt Mask</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>PTZ</name>
       <description>Pause Time Zero Interrupt Mask</description>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>PHY_MT</name>
     <description>PHY Maintenance Register.</description>
     <addressOffset>0x34</addressOffset>
     <fields>
      <field>
       <name>DATA</name>
       <description>PHY Data. For a write operation this field is the data to be written to the PHY. </description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>REGADDR</name>
       <description>Register Address. Specifies the register in the PHY to access.</description>
       <bitOffset>18</bitOffset>
       <bitWidth>5</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>PHYADDR</name>
       <description>PHY Address. Specifies the PHY to access.</description>
       <bitOffset>23</bitOffset>
       <bitWidth>5</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>OP</name>
       <description>Operation</description>
       <bitOffset>28</bitOffset>
       <bitWidth>2</bitWidth>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>write</name>
         <description>Write</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>read</name>
         <description>Read</description>
         <value>2</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SOP</name>
       <description>TBD </description>
       <bitOffset>30</bitOffset>
       <bitWidth>2</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>PT</name>
     <description>Pause Time Register.</description>
     <addressOffset>0x38</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>TIME</name>
       <description>Pause Time. Stores the current value of the pause time register, which is decremented every 512 bit times.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>PFR</name>
     <description>Pause Frame Received OK.</description>
     <addressOffset>0x3C</addressOffset>
     <fields>
      <field>
       <name>PFR</name>
       <description>Pause Frames Received OK. A 16-bit register counting the number of good pause frames received. </description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>FTOK</name>
     <description>Frames Transmitted OK.</description>
     <addressOffset>0x40</addressOffset>
     <fields>
      <field>
       <name>FTOK</name>
       <description>Frames Transmitted OK. A 32-bit register counting the number of frames successfully transmitted, i.e. no underrun and not too many retries.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>SCF</name>
     <description>Single Collision Frames.</description>
     <addressOffset>0x44</addressOffset>
     <fields>
      <field>
       <name>SCF</name>
       <description>Single Collision Frames. A 16-bit register counting the number of frames experiencing a single collision before being successfully transmitted, i.e. no underrun.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>MCF</name>
     <description>Multiple Collision Frames.</description>
     <addressOffset>0x48</addressOffset>
     <fields>
      <field>
       <name>MCF</name>
       <description>Multiple Collision Frames. A 16-bit register counting the number of frames experiencing between two and fifteen collisions prior to being successfully transmitted, i.e. no underrun and not too many retries.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>FROK</name>
     <description>Fames Received OK.</description>
     <addressOffset>0x4C</addressOffset>
     <fields>
      <field>
       <name>FROK</name>
       <description>Frames Received OK. A 24-bit register counting the number of good packets received</description>
       <bitOffset>0</bitOffset>
       <bitWidth>24</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>FCS_ERR</name>
     <description>Frame Check Sequence Errors.</description>
     <addressOffset>0x50</addressOffset>
     <fields>
      <field>
       <name>FCSERR</name>
       <description>Frame Check Sequence Errors.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>ALGN_ERR</name>
     <description>Alignment Errors.</description>
     <addressOffset>0x54</addressOffset>
     <fields>
      <field>
       <name>ALGNERR</name>
       <description>Alignment Errors. </description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>DFTXF</name>
     <description>Deferred Transmission Frames.</description>
     <addressOffset>0x58</addressOffset>
     <fields>
      <field>
       <name>DFTXF</name>
       <description>Deferred Transmission Frames. A 16-bit register counting the number of packets experiencing deferral due to carrier sense being active on their first attempt at transmission</description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>LC</name>
     <description>Late Collisions.</description>
     <addressOffset>0x5C</addressOffset>
     <fields>
      <field>
       <name>LC</name>
       <description>Late Collisions. An 8-bit register counting the number of packets that experience a collision after the slot time (512 bits) has expired.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>EC</name>
     <description>Excessive Collisions.</description>
     <addressOffset>0x60</addressOffset>
     <fields>
      <field>
       <name>EC</name>
       <description>Excessive Collisions. An 8-bit register counting the number of packets that failed to be transmitted because they experienced 16 collisions.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>TUR_ERR</name>
     <description>Transmit Underrun Errors.</description>
     <addressOffset>0x64</addressOffset>
     <fields>
      <field>
       <name>TURERR</name>
       <description>Transmit Underrun Error. An 8-bit register counting the number of packets not transmitted due to a transmit FIFO underrun.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>CS_ERR</name>
     <description>Carrier Sense Errors.</description>
     <addressOffset>0x68</addressOffset>
     <fields>
      <field>
       <name>CSERR</name>
       <description>An 8-bit register counting the number of packets transmitted where carrier sense was not seen during transmission or where carrier sense was deasserted after being asserted in a transmit packet without collision (no underrun).</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>RR_ERR</name>
     <description>Receive Resource Errors.</description>
     <addressOffset>0x6C</addressOffset>
     <fields>
      <field>
       <name>RRERR</name>
       <description>Receive Resource Errors. A 16 bit register counting the number of frames that were address matched but could not be copied to memory because no receive buffer was available.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>ROR_ERR</name>
     <description>Receive Overrun Errors.</description>
     <addressOffset>0x70</addressOffset>
     <fields>
      <field>
       <name>RORERR</name>
       <description>Receive Overruns. An 8 bit register counting the number of frames that are address recognized but were not copied to memory due to a receive DMA overrun.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>RS_ERR</name>
     <description>Receive Symbol Errors.</description>
     <addressOffset>0x74</addressOffset>
     <fields>
      <field>
       <name>RSERR</name>
       <description>Receive Symbol Errors. An 8-bit register counting the number of packets that had EMAC_RXER asserted during reception.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>EL_ERR</name>
     <description>Excessive Length Errors.</description>
     <addressOffset>0x78</addressOffset>
     <fields>
      <field>
       <name>ELERR</name>
       <description>Excessive Length Errors. An 8-bit register counting the number of packets received exceeding 1518 bytes in length (1536 if RXFR is set in the MAC_CFG register;</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>RJ</name>
     <description>Receive Jabber.</description>
     <addressOffset>0x7C</addressOffset>
     <fields>
      <field>
       <name>RJERR</name>
       <description>Receive Jabbers. An 8-bit register counting the number of packets received exceeding 1518 bytes in length (1536 if RXFR is set in the MAC_CFG register; </description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>USF</name>
     <description>Undersize Frames.</description>
     <addressOffset>0x80</addressOffset>
     <fields>
      <field>
       <name>USF</name>
       <description>Undersize Frames. An 8-bit register counting the number of packets received less than 64 bytes in length but do not have either a CRC error, an alignment error or a receive symbol error.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>SQE_ERR</name>
     <description>SQE Test Errors.</description>
     <addressOffset>0x84</addressOffset>
     <fields>
      <field>
       <name>SQEERR</name>
       <description>SQE Test Errors. An 8-bit register counting the number of packets where collision was not asserted within 96 bit times (an interframe gap) of EMAC_TXEN being deasserted in half duplex mode.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>RLFM</name>
     <description>Received Length Field Mismatch.</description>
     <addressOffset>0x88</addressOffset>
     <fields>
      <field>
       <name>RLFM</name>
       <description>Receive length field mismatch </description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>TPF</name>
     <description>Transmitted Pause Frames.</description>
     <addressOffset>0x8C</addressOffset>
     <fields>
      <field>
       <name>TPF</name>
       <description>Transmitted Pause Frames. A 16-bit register counting the number of pause packets transmitted.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>HASHL</name>
     <description>Hash Register Bottom [31:0].</description>
     <addressOffset>0x90</addressOffset>
     <fields>
      <field>
       <name>HASH</name>
       <description>Bits 31:0 of the hash address register. See Hash Addressing</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>HASHH</name>
     <description>Hash Register top [63:32].</description>
     <addressOffset>0x94</addressOffset>
     <fields>
      <field>
       <name>HASH</name>
       <description>Bits 63:32 of the hash address register. See Hash Addressing</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>SA1L</name>
     <description>Specific Address 1 Bottom.</description>
     <addressOffset>0x98</addressOffset>
     <fields>
      <field>
       <name>ADDR</name>
       <description>MAC Specific Address 1 [31:0]. Least significant bits of the MAC specific address 1, i.e. bits 31:0. This field is used for transmission of pause packets</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>SA1H</name>
     <description>Specific Address 1 Top.</description>
     <addressOffset>0x9C</addressOffset>
     <fields>
      <field>
       <name>ADDR</name>
       <description>MAC Specific Address 1 [47:32]. Most significant bits of the MAC specific address 1, i.e. bits 47:32.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>SA2L</name>
     <description>Specific Address 2 Bottom.</description>
     <addressOffset>0xA0</addressOffset>
     <fields>
      <field>
       <name>ADDR</name>
       <description>MAC Specific Address 2 [31:0]. Least significant bits of the MAC specific address 2, i.e. bits 31:0. This field is used for transmission of pause packets</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>SA2H</name>
     <description>Specific Address 2 Top.</description>
     <addressOffset>0xA4</addressOffset>
     <fields>
      <field>
       <name>ADDR</name>
       <description>MAC Specific Address 2 [47:32]. Most significant bits of the MAC specific address 2, i.e. bits 47:32.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>SA3L</name>
     <description>Specific Address 3 Bottom.</description>
     <addressOffset>0xA8</addressOffset>
     <fields>
      <field>
       <name>ADDR</name>
       <description>MAC Specific Address 3 [31:0]. Least significant bits of the MAC specific address 3, i.e. bits 31:0. This field is used for transmission of pause packets</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>SA3H</name>
     <description>Specific Address 3 Top.</description>
     <addressOffset>0xAC</addressOffset>
     <fields>
      <field>
       <name>ADDR</name>
       <description>MAC Specific Address 3 [47:32]. Most significant bits of the MAC specific address 3, i.e. bits 47:32.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>SA4L</name>
     <description>Specific Address 4 Bottom.</description>
     <addressOffset>0xB0</addressOffset>
     <fields>
      <field>
       <name>ADDR</name>
       <description>MAC Specific Address 4 [31:0]. Least significant bits of the MAC specific address 4, i.e. bits 31:0. This field is used for transmission of pause packets</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>SA4H</name>
     <description>Specific Address 4 Top.</description>
     <addressOffset>0xB4</addressOffset>
     <fields>
      <field>
       <name>ADDR</name>
       <description>MAC Specific Address 4 [47:32]. Most significant bits of the MAC specific address 4, i.e. bits 47:32.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
