analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32570/Include/max32570.svd
    <register>
     <name>PM</name>
     <description>Power Management.</description>
     <addressOffset>0x0C</addressOffset>
     <fields>
      <field>
       <name>MODE</name>
       <description>Operating Mode. This two bit field selects the current operating mode for the device. Note that code execution only occurs during ACTIVE mode.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>3</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>active</name>
         <description>Active Mode.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>deepsleep</name>
         <description>DeepSleep Mode.</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>shutdown</name>
         <description>Shutdown Mode.</description>
         <value>3</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>backup</name>
         <description>Backup Mode.</description>
         <value>4</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>GPIO_WE</name>
       <description>GPIO Wake Up Enable. This bit enables all GPIO pins as potential wakeup sources. Any GPIO configured for wakeup is capable of causing an exit from IDLE or STANDBY modes when this bit is set.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO_WE">
       <name>RTC_WE</name>
       <description>RTC Alarm Wake Up Enable. This bit enables RTC alarm as wakeup source. If enabled, the desired RTC alarm must be configured via the RTC control registers.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO_WE">
       <name>USB_WE</name>
       <description>USB Wake Up Enable. This bit enables USB activity as wakeup source.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO_WE">
       <name>HA0_WE</name>
       <description>Hardware Accelerator 0 Wake Up Enable. This bit enables USB activity as wakeup source.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO_WE">
       <name>HA1_WE</name>
       <description>Hardware Accelerator 1 Wake Up Enable. This bit enables USB activity as wakeup source.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ERFO_PD</name>
       <description>Radio Frequency oscilator Crystal Power Down. This bit selects the power state in DEEPSLEEP mode. </description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>active</name>
         <description>Mode is Active.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>deepsleep</name>
         <description>Powered down in DEEPSLEEP.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ISO_PD</name>
       <description>Internal Secondary Oscilator Power Down. This bit selects the power state in DEEPSLEEP mode. </description>
       <bitOffset>15</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>active</name>
         <description>Mode is Active.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>deepsleep</name>
         <description>Powered down in DEEPSLEEP.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>IPO_PD</name>
       <description>Internal Primary Oscilatory power down. This bit selects the power state in DEEPSLEEP mode. </description>
       <bitOffset>16</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>active</name>
         <description>Mode is Active.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>deepsleep</name>
         <description>Powered down in DEEPSLEEP.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>IBRO_PD</name>
       <description>Internal Baud Rate Oscillator power down. This bit selects the power state in DEEPSLEEP mode. </description>
       <bitOffset>17</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>active</name>
         <description>Mode is Active.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>deepsleep</name>
         <description>Powered down in DEEPSLEEP.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>NFC_PD</name>
       <description>When set, the NFC radio becomes inactive when the upon entering DEEPSLEEP mode</description>
       <bitOffset>18</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>active</name>
         <description>Mode is Active.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>deepsleep</name>
         <description>Powered down in DEEPSLEEP.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>XTALBP</name>
       <description>XTAL Bypass </description>
       <bitOffset>20</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>normal</name>
         <description>Normal</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>bypass</name>
         <description>Bypass</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>PCLKDIV</name>
     <description>Peripheral Clock Divider.</description>
     <addressOffset>0x18</addressOffset>
     <resetValue>0x00000001</resetValue>
     <fields>
      <field>
       <name>PCF</name>
       <description>These bits determine the clock frequency for the UART, I2C and Key Pad peripherals. These peripherals have an adaptive clock generator that dynamically adjusts the peripheral frequency based on the main system bus frequency. These bits are dynamically updated when the PLL0 is selected as the system clock source and are set by hardware. These bits determine the clock frequency for the UART, I2C and Key Pad peripherals. These peripherals have an adaptive clock generator that dynamically adjusts the peripheral frequency based on the main system bus frequency. These bits are dynamically updated when the PLL0 is selected as the system clock source and are set by hardware.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>3</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>96MHz</name>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>48MHz</name>
         <value>3</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>24MHz</name>
         <value>4</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>12MHz</name>
         <value>5</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>6MHz</name>
         <value>6</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>3MHz</name>
         <value>7</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>PCFWEN</name>
       <description>PCF Write Enable. This bit allows the PCF Register bits to be updated by Software.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>blocked</name>
         <description>Writes to PCF are blocked.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>allowed</name>
         <description>Writes to PCF are allowed</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SDHCFRQ</name>
       <description>SDHC Clock Frequency. This bits defines the clock frequency of SDHC.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>48MHz</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>24MHz</name>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ADCFRQ</name>
       <description>ADC clock Frequency. These bits define the ADC clock frequency. FADC = FPCLK/ (ADCFRQ).</description>
       <bitOffset>10</bitOffset>
       <bitWidth>4</bitWidth>
      </field>
      <field>
       <name>AON_CLKDIV</name>
       <description>Always-ON (AON) domain CLock Divider. These bits define the AON domain clock divider.</description>
       <bitOffset>14</bitOffset>
       <bitWidth>2</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>div_4</name>
         <description>PCLK divide by 4.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>div_8</name>
         <description>PCLK divide by 8.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>div_16</name>
         <description>PCLK divide by 16.</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>div_32</name>
         <description>PCLK divide by 32.</description>
         <value>3</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>PCLKDIS0</name>
     <description>Peripheral Clock Disable.</description>
     <addressOffset>0x24</addressOffset>
     <fields>
      <field>
       <name>GPIO0</name>
       <description>GPIO0 Clock Disable.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>en</name>
         <description>enable it.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>dis</name>
         <description>disable it.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field derivedFrom="GPIO0">
       <name>GPIO1</name>
       <description>GPIO1 Disable.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0">
       <name>GPIO2</name>
       <description>GPIO2 Disable.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0">
       <name>USB</name>
       <description>USB Disable.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0">
       <name>CLCD</name>
       <description>CLCD Disable.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0">
       <name>DMA</name>
       <description>DMA Disable.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0">
       <name>SPI0</name>
       <description>SPI 0 Disable.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0">
       <name>SPI1</name>
       <description>SPI 1 Disable.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0">
       <name>SPI2</name>
       <description>SPI 2 Disable.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0">
       <name>UART0</name>
       <description>UART 0 Disable.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0">
       <name>UART1</name>
       <description>UART 1 Disable.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0">
       <name>I2C0</name>
       <description>I2C 0 Disable.</description>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0">
       <name>CRYPTO</name>
       <description>Crypto Disable.</description>
       <bitOffset>14</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0">
       <name>TMR0</name>
       <description>Timer 0 Disable.</description>
       <bitOffset>15</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0">
       <name>TMR1</name>
       <description>Timer 1 Disable.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0">
       <name>TMR2</name>
       <description>Timer 2 Disable.</description>
       <bitOffset>17</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0">
       <name>TMR3</name>
       <description>Timer 3 Disable.</description>
       <bitOffset>18</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0">
       <name>TMR4</name>
       <description>Timer 4 Disable.</description>
       <bitOffset>19</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0">
       <name>TMR5</name>
       <description>Timer 5 Disable.</description>
       <bitOffset>20</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0">
       <name>KBD</name>
       <description>Secure Keyboard Disable.</description>
       <bitOffset>22</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0">
       <name>ADC</name>
       <description>ADC Disable.</description>
       <bitOffset>23</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0">
       <name>TMR6</name>
       <description>Timer 6 Disable.</description>
       <bitOffset>24</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0">
       <name>TMR7</name>
       <description>Timer 7 Disable.</description>
       <bitOffset>25</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0">
       <name>HTMR0</name>
       <description>HTimer 0 Disable.</description>
       <bitOffset>26</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0">
       <name>HTMR1</name>
       <description>HTimer 1 Disable.</description>
       <bitOffset>27</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0">
       <name>I2C1</name>
       <description>I2C 1 Disable.</description>
       <bitOffset>28</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0">
       <name>PT</name>
       <description>PT Clock Disable.</description>
       <bitOffset>29</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0">
       <name>SPIXIP</name>
       <description>SPI XiP Disable.</description>
       <bitOffset>30</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="GPIO0">
       <name>SPIM</name>
       <description>SPI XiP Master Controller Disable.</description>
       <bitOffset>31</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>MEMCTRL</name>
     <description>Memory Clock Control Register.</description>
     <addressOffset>0x28</addressOffset>
     <fields>
      <field>
       <name>FWS</name>
       <description>Flash Wait State. These bits define the number of wait-state cycles per Flash data read access. Minimum wait state is 2.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>3</bitWidth>
      </field>
      <field>
       <name>RAMWS_EN</name>
       <description>SRAM Wait State Enable</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RAM0LS_EN</name>
       <description>System RAM 0 Light Sleep Mode.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>active</name>
         <description>RAM is active.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>light_sleep</name>
         <description>RAM is in Light Sleep mode.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field derivedFrom="RAM0LS_EN">
       <name>RAM1LS_EN</name>
       <description>System RAM 1 Light Sleep Mode.</description>
       <bitOffset>17</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="RAM0LS_EN">
       <name>RAM2LS_EN</name>
       <description>System RAM 2 Light Sleep Mode.</description>
       <bitOffset>18</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="RAM0LS_EN">
       <name>RAM3LS_EN</name>
       <description>System RAM 3 Light Sleep Mode.</description>
       <bitOffset>19</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="RAM0LS_EN">
       <name>RAM4LS_EN</name>
       <description>System RAM 4 Light Sleep Mode.</description>
       <bitOffset>20</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="RAM0LS_EN">
       <name>RAM5LS_EN</name>
       <description>System RAM 5 Light Sleep Mode.</description>
       <bitOffset>21</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="RAM0LS_EN">
       <name>ICC0LS_EN</name>
       <description>ICache RAM Light Sleep Mode.</description>
       <bitOffset>24</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="RAM0LS_EN">
       <name>ICCXIPLS_EN</name>
       <description>ICACHE-XIP RAM Light Sleep Mode.</description>
       <bitOffset>25</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="RAM0LS_EN">
       <name>SRCCLS_EN</name>
       <description>SysCache RAM Light Sleep Mode.</description>
       <bitOffset>26</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="RAM0LS_EN">
       <name>CRYPTOLS_EN</name>
       <description>CRYPTO RAM Light Sleep Mode.</description>
       <bitOffset>27</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="RAM0LS_EN">
       <name>USBLS_EN</name>
       <description>USB FIFO Light Sleep Mode.</description>
       <bitOffset>28</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="RAM0LS_EN">
       <name>ROMLS_EN</name>
       <description>ROM Light Sleep Mode.</description>
       <bitOffset>29</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>MEMZ</name>
     <description>Memory Zeroize Control.</description>
     <addressOffset>0x2C</addressOffset>
     <fields>
      <field>
       <name>RAM0</name>
       <description>System RAM Block 0.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>nop</name>
         <description>No operation/complete.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>start</name>
         <description>Start operation.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field derivedFrom="RAM0">
       <name>RAM1</name>
       <description>System RAM Block 1.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="RAM0">
       <name>RAM2</name>
       <description>System RAM Block 2.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="RAM0">
       <name>RAM3</name>
       <description>System RAM Block 3.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="RAM0">
       <name>RAM4</name>
       <description>System RAM Block 4.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="RAM0">
       <name>RAM5</name>
       <description>System RAM Block 5.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="RAM0">
       <name>RAM6</name>
       <description>System RAM Block 6.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="RAM0">
       <name>ICC0</name>
       <description>Instruction Cache.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="RAM0">
       <name>ICCXIP</name>
       <description>Instruction Cache XIP Data and Tag Ram zeroizatoin.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="RAM0">
       <name>SCACHEDATA</name>
       <description>System Cache Data Ram Zeroization.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="RAM0">
       <name>SCACHETAG</name>
       <description>System Cache Tag Zeroization.</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="RAM0">
       <name>CRYPTO</name>
       <description>Crypto (MAA) Memory.</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="RAM0">
       <name>USBFIFO</name>
       <description>USB FIFO Zeroization.</description>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>SCCK</name>
     <description>Smart Card Clock Control.</description>
     <addressOffset>0x34</addressOffset>
     <resetValue>0x00000000</resetValue>
     <fields>
      <field>
       <name>SC0CD</name>
       <description>Smart Card0 Clock Divider</description>
       <bitOffset>0</bitOffset>
       <bitWidth>6</bitWidth>
      </field>
      <field>
       <name>SC1CD</name>
       <description>Smart Card1 Clock Divider</description>
       <bitOffset>8</bitOffset>
       <bitWidth>6</bitWidth>
      </field>
     </fields>
    </register>
