analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32570/Include/max32570.svd
    <register>
     <name>PRESET_2</name>
     <description>Preset Value for High Speed.</description>
     <addressOffset>0x064</addressOffset>
     <size>16</size>
     <access>read-only</access>
     <fields>
      <field>
       <name>SDCLK_FREQ</name>
       <description>SDCLK Frequency Select Value.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>10</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>CLK_GEN</name>
       <description>Clock Generator Select Value.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>DRIVER_STRENGTH</name>
       <description>Driver Strength Select Value.</description>
       <bitOffset>14</bitOffset>
       <bitWidth>2</bitWidth>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>PRESET_3</name>
     <description>Preset Value for SDR12.</description>
     <addressOffset>0x066</addressOffset>
     <size>16</size>
     <access>read-only</access>
     <fields>
      <field>
       <name>SDCLK_FREQ</name>
       <description>SDCLK Frequency Select Value.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>10</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>CLK_GEN</name>
       <description>Clock Generator Select Value.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>DRIVER_STRENGTH</name>
       <description>Driver Strength Select Value.</description>
       <bitOffset>14</bitOffset>
       <bitWidth>2</bitWidth>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>PRESET_4</name>
     <description>Preset Value for SDR25.</description>
     <addressOffset>0x068</addressOffset>
     <size>16</size>
     <access>read-only</access>
     <fields>
      <field>
       <name>SDCLK_FREQ</name>
       <description>SDCLK Frequency Select Value.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>10</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>CLK_GEN</name>
       <description>Clock Generator Select Value.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>DRIVER_STRENGTH</name>
       <description>Driver Strength Select Value.</description>
       <bitOffset>14</bitOffset>
       <bitWidth>2</bitWidth>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>PRESET_5</name>
     <description>Preset Value for SDR50.</description>
     <addressOffset>0x06A</addressOffset>
     <size>16</size>
     <access>read-only</access>
     <fields>
      <field>
       <name>SDCLK_FREQ</name>
       <description>SDCLK Frequency Select Value.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>10</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>CLK_GEN</name>
       <description>Clock Generator Select Value.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>DRIVER_STRENGTH</name>
       <description>Driver Strength Select Value.</description>
       <bitOffset>14</bitOffset>
       <bitWidth>2</bitWidth>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>PRESET_6</name>
     <description>Preset Value for SDR104.</description>
     <addressOffset>0x06C</addressOffset>
     <size>16</size>
     <access>read-only</access>
     <fields>
      <field>
       <name>SDCLK_FREQ</name>
       <description>SDCLK Frequency Select Value.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>10</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>CLK_GEN</name>
       <description>Clock Generator Select Value.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>DRIVER_STRENGTH</name>
       <description>Driver Strength Select Value.</description>
       <bitOffset>14</bitOffset>
       <bitWidth>2</bitWidth>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>PRESET_7</name>
     <description>Preset Value for DDR50.</description>
     <addressOffset>0x06E</addressOffset>
     <size>16</size>
     <access>read-only</access>
     <fields>
      <field>
       <name>SDCLK_FREQ</name>
       <description>SDCLK Frequency Select Value.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>10</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>CLK_GEN</name>
       <description>Clock Generator Select Value.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>DRIVER_STRENGTH</name>
       <description>Driver Strength Select Value.</description>
       <bitOffset>14</bitOffset>
       <bitWidth>2</bitWidth>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>SLOT_INT</name>
     <description>Slot Interrupt Status.</description>
     <addressOffset>0x0FC</addressOffset>
     <size>16</size>
     <access>read-only</access>
     <fields>
      <field>
       <name>INT_SIGNALS</name>
       <description>Interrupt Signal For Each Slot.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>HOST_CN_VER</name>
     <description>Host Controller Version.</description>
     <addressOffset>0x0FE</addressOffset>
     <size>16</size>
     <fields>
      <field>
       <name>SPEC_VER</name>
       <description>Specification Version Number.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
      <field>
       <name>VEND_VER</name>
       <description>Vendor Version Number.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
     </fields>
    </register>
