analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32570/Include/max32570.svd
    <register>
     <name>SECDIAG</name>
     <description>Security Diagnostic Register.</description>
     <addressOffset>0x0C</addressOffset>
     <access>read-write</access>
     <resetValue>0x00000001</resetValue>
     <resetMask>0xFFC0FE02</resetMask>
     <fields>
      <field>
       <name>PORF</name>
       <description>Power-On-Reset Flag. This bit is set once the power supply is conneted.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>noEvent</name>
         <description>The event has not occurred.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>occurred</name>
         <description>The event has occurred.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SHIELDF</name>
       <description>Die Shield Flag.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>noEvent</name>
         <description>The event has not occurred.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>occurred</name>
         <description>The event has occurred.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>LOTEMP</name>
       <description>Low Temperature Detect.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>noEvent</name>
         <description>The event has not occurred.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>occurred</name>
         <description>The event has occurred.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>HITEMP</name>
       <description>High Temperature Detect.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>noEvent</name>
         <description>The event has not occurred.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>occurred</name>
         <description>The event has occurred.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>BATLO</name>
       <description>Battery Undervoltage Detect.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>noEvent</name>
         <description>The event has not occurred.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>occurred</name>
         <description>The event has occurred.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>BATHI</name>
       <description>Battery Overvoltage Detect.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>noEvent</name>
         <description>The event has not occurred.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>occurred</name>
         <description>The event has occurred.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>DYNF</name>
       <description>Dynamic Sensor Flag.  This bit is set to 1 when any of the EXTSTAT bits are set.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>noEvent</name>
         <description>The event has not occurred.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>occurred</name>
         <description>The event has occurred.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>AESK_MDU</name>
       <description>AES Key Transfer. This bit is set to 1 when AES MDU Key has been transferred from the TRNG to the battery backed AES key register. This bit can only be reset by a BOR.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>incomplete</name>
         <description>Key has not been transferred.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>complete</name>
         <description>Key has been transferred.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>AESK_NVSRAM</name>
       <description>NVSRAM 256-bit AES Key Cleared. This field is set to 1 by hardware if the NVSRAM AES key is zero. This field resets to 1 on a POR.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>nonzero</name>
         <description>Key is non-zero.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>zero</name>
         <description>Key is zero.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>AESK_SPIXF</name>
       <description>SPIXF 128-Bit AES Key Cleared. This field is set to 1 by hardware if the SPIXR 128-bit AES key is zero. This field resets to 1 on a POR.</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>nonzero</name>
         <description>Key is non-zero.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>zero</name>
         <description>Key is zero.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>AESK_SPIXR</name>
       <description>SPIXR 128-Bit AES Key Cleared. This field is set to 1 by hardware if the SPIXR 128-bit AES key is zero. This field resets to 1 on a POR.</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>nonzero</name>
         <description>Key is non-zero.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>zero</name>
         <description>Key is zero.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>EXTSTAT0</name>
       <description>External Sensor 0 Detect.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>noEvent</name>
         <description>The event has not occurred.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>occurred</name>
         <description>The event has occurred.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>EXTSTAT1</name>
       <description>External Sensor 1 Detect.</description>
       <bitOffset>17</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>noEvent</name>
         <description>The event has not occurred.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>occurred</name>
         <description>The event has occurred.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>EXTSTAT2</name>
       <description>External Sensor 2 Detect.</description>
       <bitOffset>18</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>noEvent</name>
         <description>The event has not occurred.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>occurred</name>
         <description>The event has occurred.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>EXTSTAT3</name>
       <description>External Sensor 3 Detect.</description>
       <bitOffset>19</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>noEvent</name>
         <description>The event has not occurred.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>occurred</name>
         <description>The event has occurred.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>EXTSTAT4</name>
       <description>External Sensor 4 Detect.</description>
       <bitOffset>20</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>noEvent</name>
         <description>The event has not occurred.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>occurred</name>
         <description>The event has occurred.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>EXTSTAT5</name>
       <description>External Sensor 5 Detect.</description>
       <bitOffset>21</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>noEvent</name>
         <description>The event has not occurred.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>occurred</name>
         <description>The event has occurred.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>DLRTC</name>
     <description>DRS Log RTC Value. This register contains the 32 bit value in the RTC second register when the last DRS event occurred.</description>
     <addressOffset>0x10</addressOffset>
     <access>read-only</access>
     <resetMask>0x00000000</resetMask>
     <fields>
      <field>
       <name>DLRTC</name>
       <description>DRS Log RTC Value. This register contains the 32 bit value in the RTC second register when the last DRS event occurred.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>MEUCFG</name>
     <description>MEU Configuration</description>
     <addressOffset>0x24</addressOffset>
     <resetMask>0x00000000</resetMask>
     <fields>
      <field>
       <name>ENC_REG0</name>
       <description> NVSRAM Encryption Enable Region 0. Setting this field to 1 enables encryption using the MEU of region 0 of the NVSRAM.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>plaintext</name>
         <description>Plain text.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>encrypted</name>
         <description>Encrypted.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ENC_REG1</name>
       <description> NVSRAM Encryption Enable Region 1. Setting this field to 1 enables encryption using the MEU of region 1 of the NVSRAM.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>plaintext</name>
         <description>Plain text.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>encrypted</name>
         <description>Encrypted.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ENC_REG2</name>
       <description> NVSRAM Encryption Enable Region 2. Setting this field to 1 enables encryption using the MEU of region 2 of the NVSRAM.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>plaintext</name>
         <description>Plain text.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>encrypted</name>
         <description>Encrypted.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ENC_REG3</name>
       <description> NVSRAM Encryption Enable Region 3. Setting this field to 1 enables encryption using the MEU of region 3 of the NVSRAM.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>plaintext</name>
         <description>Plain text.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>encrypted</name>
         <description>Encrypted.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ENC_REG4</name>
       <description> NVSRAM Encryption Enable Region 4. Setting this field to 1 enables encryption using the MEU of region 4 of the NVSRAM.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>plaintext</name>
         <description>Plain text.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>encrypted</name>
         <description>Encrypted.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ENC_REG5</name>
       <description> NVSRAM Encryption Enable Region 5. Setting this field to 1 enables encryption using the MEU of region 5 of the NVSRAM.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>plaintext</name>
         <description>Plain text.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>encrypted</name>
         <description>Encrypted.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ENC_REG6</name>
       <description> NVSRAM Encryption Enable Region 6. Setting this field to 1 enables encryption using the MEU of region 6 of the NVSRAM.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>plaintext</name>
         <description>Plain text.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>encrypted</name>
         <description>Encrypted.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ENC_REG7</name>
       <description> NVSRAM Encryption Enable Region 7. Setting this field to 1 enables encryption using the MEU of region 7 of the NVSRAM.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>plaintext</name>
         <description>Plain text.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>encrypted</name>
         <description>Encrypted.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>LOCK</name>
       <description>Lock.</description>
       <bitOffset>31</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>SECST</name>
     <description>Security Monitor Status Register.</description>
     <addressOffset>0x34</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>EXTSRS</name>
       <description>External Sensor Control Register Status.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>allowed</name>
         <description>Access authorized.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>notAllowed</name>
         <description>Access not authorized.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>INTSRS</name>
       <description>Internal Sensor Control Register Status.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>allowed</name>
         <description>Access authorized.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>notAllowed</name>
         <description>Access not authorized.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SECALRS</name>
       <description>Security Alarm Register Status.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>allowed</name>
         <description>Access authorized.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>notAllowed</name>
         <description>Access not authorized.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>MEUCFG</name>
       <description>MEU Configuration Register Status.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>normal</name>
         <description>Normal Operation.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>busy</name>
         <description>Busy.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>SDBE</name>
     <description>Security Monitor Self Destruct Byte.</description>
     <addressOffset>0x38</addressOffset>
     <fields>
      <field>
       <name>DBYTE</name>
       <description>Self Destruct Byte</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>SBDEN</name>
       <description>Self-Destruct Byte Enable.</description>
       <bitOffset>31</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
